In [6]:
import pandas as pd
import numpy as np

In [34]:
df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
                   'B': {0: 1, 1: 3, 2: 5},
                   'C': {0: 2, 1: 4, 2: 6}})
df

   A  B  C
0  a  1  2
1  b  3  4
2  c  5  6

In [36]:
#df.melt()
pd.melt(df)

  variable value
0        A     a
1        A     b
2        A     c
3        B     1
4        B     3
5        B     5
6        C     2
7        C     4
8        C     6

In [37]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
df

   foo bar  baz zoo
0  one   A    1   x
1  one   B    2   y
2  one   C    3   z
3  two   A    4   q
4  two   B    5   w
5  two   C    6   t

In [43]:
df.set_index(['foo','bar'])['baz'].unstack()

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [40]:
df.pivot(index='foo', columns='bar', values='baz')

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [2]:
df = pd.DataFrame({'population': [59000000, 65000000, 434000,
                                  434000, 434000, 337000, 11300,
                                  11300, 11300],
                   'GDP': [1937894, 2583560 , 12011, 4520, 12128,
                           17036, 182, 38, 311],
                   'alpha-2': ["IT", "FR", "MT", "MV", "BN",
                               "IS", "NR", "TV", "AI"]},
                  index=["Italy", "France", "Malta",
                         "Maldives", "Brunei", "Iceland",
                         "Nauru", "Tuvalu", "Anguilla"])

In [3]:
df

          population      GDP alpha-2
Italy       59000000  1937894      IT
France      65000000  2583560      FR
Malta         434000    12011      MT
Maldives      434000     4520      MV
Brunei        434000    12128      BN
Iceland       337000    17036      IS
Nauru          11300      182      NR
Tuvalu         11300       38      TV
Anguilla       11300      311      AI

In [4]:
df.nlargest(3, 'population')

        population      GDP alpha-2
France    65000000  2583560      FR
Italy     59000000  1937894      IT
Malta       434000    12011      MT

In [7]:
df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
                  index=['mouse', 'rabbit'],
                  columns=['one', 'two', 'three'])
df

        one  two  three
mouse     1    2      3
rabbit    4    5      6

In [8]:
df.filter(items=['one', 'three'])

        one  three
mouse     1      3
rabbit    4      6

In [9]:
df[['one', 'three']]

        one  three
mouse     1      3
rabbit    4      6

In [10]:
# e로 끝나는 컬럼들만 선택
df.filter(regex='e$', axis=1)

        one  three
mouse     1      3
rabbit    4      6

In [11]:
# bbi를 포함하는 행 선택
df.filter(like='bbi', axis=0)

        one  two  three
rabbit    4    5      6

In [29]:
import random

#1~500 사이의 값 100개 생성
data = pd.Series(random.sample(range(1,500), 100))
data

0     154
1     269
2     308
3     333
4     247
     ...
95     87
96    372
97    449
98    254
99    381
Length: 100, dtype: int64

In [33]:
pd.qcut(data, 4, labels = [1,2,3,4])

0     2
1     3
2     3
3     3
4     3
     ..
95    1
96    4
97    4
98    3
99    4
Length: 100, dtype: category
Categories (4, int64): [1 < 2 < 3 < 4]